uhnp/src/Enums/СпособыУчетаГодовогоЗаработкаСФР/СпособыУчетаГодовогоЗаработкаСФР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыУчетаГодовогоЗаработкаСФР</name>
  <enumValues>
    <name>ВсеСтрахователи</name>
  </enumValues>
  <enumValues>
    <name>ТекущийСтрахователь</name>
  </enumValues>
  <enumValues>
    <name>ВсеСтрахователиЗаТекущийПериодРаботы</name>
    <comment>Для ежемесячного пособия по уходу за ребенком до достижения им возраста 1,5 лет</comment>
  </enumValues>
  <enumValues>
    <name>ТекущиеСтрахователиЗаТекущийПериодРаботыИДругие</name>
    <comment>Для ежемесячного пособия по уходу за ребенком до достижения им возраста 1,5 лет</comment>
  </enumValues>
  <enumValues>
    <name>ВсеСтрахователиГПХ</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СпособыУчетаГодовогоЗаработкаСФР/ManagerModule.bsl
Функция СтрокаXML(Значение) Экспорт
	Если Значение = ВсеСтрахователи Тогда
		Возврат "amountForAllInsurers";
	ИначеЕсли Значение = ТекущийСтрахователь Тогда
		Возврат "amountForCurrentInsurer";
	ИначеЕсли Значение = ВсеСтрахователиЗаТекущийПериодРаботы Тогда
		Возврат "amountForCurrentAndPrevOtherInsurers";
	ИначеЕсли Значение = ТекущиеСтрахователиЗаТекущийПериодРаботыИДругие Тогда
		Возврат "amountForCurrentInsurerAndPrevOtherInsurersAndAllInsurers";
	ИначеЕсли Значение = ВсеСтрахователиГПХ Тогда
		Возврат "amountForAllInsurersGph";
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

Функция ЗначениеИзXML(КодСФР) Экспорт
	Если СтрСравнить(КодСФР, "amountForAllInsurers") = 0 Тогда
		Возврат ВсеСтрахователи;
	ИначеЕсли СтрСравнить(КодСФР, "amountForCurrentInsurer") = 0 Тогда
		Возврат ТекущийСтрахователь;
	ИначеЕсли СтрСравнить(КодСФР, "amountForCurrentAndPrevOtherInsurers") = 0 Тогда
		Возврат ВсеСтрахователиЗаТекущийПериодРаботы;
	ИначеЕсли СтрСравнить(КодСФР, "amountForCurrentInsurerAndPrevOtherInsurersAndAllInsurers") = 0 Тогда
		Возврат ТекущиеСтрахователиЗаТекущийПериодРаботыИДругие;
	ИначеЕсли СтрСравнить(КодСФР, "amountForAllInsurersGph") = 0 Тогда
		Возврат ВсеСтрахователиГПХ;
	Иначе
		Возврат ПустаяСсылка();
	КонецЕсли;
КонецФункции
